Ashwin-8921/STM32/STM32_REG/09_RTC_LCD/Src/main.c
#include"stm32l4xx.h"
#include"stdio.h"
#include"RTC.h"
#include"LCD.h"


#define SYSTICK_TIM_CLK   16000000UL

void init_systick_timer(uint32_t tick_hz);
char* get_day_of_week(uint8_t i);
void number_to_string(uint8_t num , char* buf);
char* time_to_string(RTC_time_t *rtc_time);
char* date_to_string(RTC_date_t *rtc_date);
void init_systick_timer(uint32_t tick_hz);


int main()
{
	 RTC_time_t current_time;
	 RTC_date_t current_date;

	 printf("RTC test\n");

	 if(ds1307_init())
	 {
	     printf("RTC init has failed\n");
	     while(1);
	 }

	 init_systick_timer(1);


	    current_date.day = FRIDAY;
	    current_date.date = 15;
	    current_date.month = 1;
	    current_date.year = 21;

	    current_time.hours = 4;
	    current_time.minutes = 25;
	    current_time.seconds = 41;
	    current_time.time_format = TIME_FORMAT_12HRS_PM;

	    ds1307_set_current_date(&current_date);
	   	ds1307_set_current_time(&current_time);

	    ds1307_get_current_date(&current_date);
	    ds1307_get_current_time(&current_time);

}


char* get_day_of_week(uint8_t i)
{
	char* days[] = { "Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"};
	return days[i-1];
}


void number_to_string(uint8_t num , char* buf)
{
	if(num < 10){
		buf[0] = '0';
		buf[1] = num + 48; // ASCII conversion
	}else if(num >= 10 && num < 99){
		buf[0] = (num/10) + 48;
		buf[1]= (num % 10) + 48;
	}
}



char* time_to_string(RTC_time_t *rtc_time)
{
	static char buf[9];

	buf[2]= ':';
	buf[5]= ':';

	number_to_string(rtc_time->hours, buf);
	number_to_string(rtc_time->minutes, &buf[3]);
	number_to_string(rtc_time->seconds, &buf[6]);

	buf[8] = '\0';
	return buf;
}



char* date_to_string(RTC_date_t *rtc_date)
{
	static char buf[9];

	buf[2]= '/';
	buf[5]= '/';

	number_to_string(rtc_date->date, buf);
	number_to_string(rtc_date->month, &buf[3]);
	number_to_string(rtc_date->year, &buf[6]);

	buf[8]= '\0';
	return buf;
}


void init_systick_timer(uint32_t tick_hz)
{
	uint32_t *pSRVR = (uint32_t*)0xE000E014;
	uint32_t *pSCSR = (uint32_t*)0xE000E010;
    uint32_t count_value = (SYSTICK_TIM_CLK/tick_hz)-1;

    *pSRVR &= ~(0x00FFFFFFFF);
    *pSRVR |= count_value;
    *pSCSR |= ( 1 << 1);
    *pSCSR |= ( 1 << 2);
    *pSCSR |= ( 1 << 0);
}
